web/tests/load/landing-stress.yml
config:
  target: "http://localhost:3000"
  phases:
    - name: "Warm-up"
      duration: 30
      arrivalRate: 5
    - name: "Ramp up"
      duration: 60
      arrivalRate: 10
      rampTo: 100
    - name: "Sustained spike"
      duration: 60
      arrivalRate: 100
    - name: "Cool down"
      duration: 30
      arrivalRate: 10
  defaults:
    headers:
      Accept: "text/html,application/xhtml+xml"
scenarios:
  - name: "Browse public pages"
    weight: 70
    flow:
      - get:
          url: "/"
      - get:
          url: "/keamanan"
      - get:
          url: "/dashboard"
  - name: "View report"
    weight: 30
    flow:
      - get:
          url: "/report/demo?url=https%3A%2F%2Fexample.com&preset=pre-launch"